Ralim/IronOS/source/Core/BSP/Magic/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_pwm.c
/**
 ******************************************************************************
 * @file    bl702_pwm.c
 * @version V1.0
 * @date
 * @brief   This file is the standard driver c file
 ******************************************************************************
 * @attention
 *
 * <h2><center>&copy; COPYRIGHT(c) 2020 Bouffalo Lab</center></h2>
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *   1. Redistributions of source code must retain the above copyright notice,
 *      this list of conditions and the following disclaimer.
 *   2. Redistributions in binary form must reproduce the above copyright notice,
 *      this list of conditions and the following disclaimer in the documentation
 *      and/or other materials provided with the distribution.
 *   3. Neither the name of Bouffalo Lab nor the names of its contributors
 *      may be used to endorse or promote products derived from this software
 *      without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
 * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
 * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
 * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 ******************************************************************************
 */

#include "bl702_pwm.h"
#include "bl702_glb.h"

/** @addtogroup  BL702_Peripheral_Driver
 *  @{
 */

/** @addtogroup  PWM
 *  @{
 */

/** @defgroup  PWM_Private_Macros
 *  @{
 */
#define PWM_Get_Channel_Reg(ch) (PWM_BASE + PWM_CHANNEL_OFFSET + (ch)*0x20)
#define PWM_INT_TIMEOUT_COUNT   (160 * 1000)
#define PWM_STOP_TIMEOUT_COUNT  (160 * 1000)

/*@} end of group PWM_Private_Macros */

/** @defgroup  PWM_Private_Types
 *  @{
 */

/*@} end of group PWM_Private_Types */

/** @defgroup  PWM_Private_Variables
 *  @{
 */

/**
 *  @brief PWM interrupt callback function address array
 */
static intCallback_Type *PWMIntCbfArra[PWM_CH_MAX][PWM_INT_ALL] = {{NULL}};

/*@} end of group PWM_Private_Variables */

/** @defgroup  PWM_Global_Variables
 *  @{
 */

/*@} end of group PWM_Global_Variables */

/** @defgroup  PWM_Private_Fun_Declaration
 *  @{
 */
#ifndef BFLB_USE_HAL_DRIVER
static BL_Err_Type PWM_IntHandler(IRQn_Type intPeriph);
#endif

/*@} end of group PWM_Private_Fun_Declaration */

/** @defgroup  PWM_Private_Functions
 *  @{
 */

/****************************************************************************/ /**
                                                                                * @brief  PWM interrupt handle
                                                                                *
                                                                                * @param  intPeriph: Select the peripheral, such as PWM0_IRQn
                                                                                *
                                                                                * @return SUCCESS
                                                                                *
                                                                                *******************************************************************************/
#ifndef BFLB_USE_HAL_DRIVER
static BL_Err_Type PWM_IntHandler(IRQn_Type intPeriph) {
  uint32_t i;
  uint32_t tmpVal;
  uint32_t timeoutCnt = PWM_INT_TIMEOUT_COUNT;
  /* Get channel register */
  uint32_t PWMx = PWM_BASE;

  for (i = 0; i < PWM_CH_MAX; i++) {
    tmpVal = BL_RD_REG(PWMx, PWM_INT_CONFIG);

    if ((BL_GET_REG_BITS_VAL(tmpVal, PWM_INTERRUPT_STS) & (1 << i)) != 0) {
      /* Clear interrupt */
      tmpVal |= (1 << (i + PWM_INT_CLEAR_POS));
      BL_WR_REG(PWMx, PWM_INT_CONFIG, tmpVal);

      /* FIXME: we need set pwm_int_clear to 0 by software and
         before this,we must make sure pwm_interrupt_sts is 0*/
      do {
        tmpVal = BL_RD_REG(PWMx, PWM_INT_CONFIG);
        timeoutCnt--;

        if (timeoutCnt == 0) {
          break;
        }
      } while (BL_GET_REG_BITS_VAL(tmpVal, PWM_INTERRUPT_STS) & (1 << i));

      tmpVal &= (~(1 << (i + PWM_INT_CLEAR_POS)));
      BL_WR_REG(PWMx, PWM_INT_CONFIG, tmpVal);

      if (PWMIntCbfArra[i][PWM_INT_PULSE_CNT] != NULL) {
        /* Call the callback function */
        PWMIntCbfArra[i][PWM_INT_PULSE_CNT]();
      }
    }
  }

  return SUCCESS;
}
#endif

/*@} end of group PWM_Private_Functions */

/** @defgroup  PWM_Public_Functions
 *  @{
 */

/****************************************************************************/ /**
                                                                                * @brief  PWM channel init
                                                                                *
                                                                                * @param  chCfg: PWM configuration
                                                                                *
                                                                                * @return SUCCESS
                                                                                *
                                                                                *******************************************************************************/
BL_Err_Type PWM_Channel_Init(PWM_CH_CFG_Type *chCfg) {
  uint32_t tmpVal;
  uint32_t timeoutCnt = PWM_STOP_TIMEOUT_COUNT;
  /* Get channel register */
  uint32_t PWMx = PWM_Get_Channel_Reg(chCfg->ch);

  /* Check the parameters */
  CHECK_PARAM(IS_PWM_CH_ID_TYPE(chCfg->ch));
  CHECK_PARAM(IS_PWM_CLK_TYPE(chCfg->clk));
  CHECK_PARAM(IS_PWM_POLARITY_TYPE(chCfg->pol));
  CHECK_PARAM(IS_PWM_STOP_MODE_TYPE(chCfg->stopMode));

