Ralim/IronOS/source/Core/BSP/Magic/bl_mcu_sdk/drivers/bl702_driver/std_drv/src/bl702_pwm.c
  /* Disable clock gate */
  GLB_AHB_Slave1_Clock_Gate(DISABLE, BL_AHB_SLAVE1_PWM);

  /* Config pwm clock and polarity */
  tmpVal = BL_RD_REG(PWMx, PWM_CONFIG);
  BL_WR_REG(PWMx, PWM_CONFIG, BL_SET_REG_BIT(tmpVal, PWM_STOP_EN));

  while (!BL_IS_REG_BIT_SET(BL_RD_REG(PWMx, PWM_CONFIG), PWM_STS_TOP)) {
    timeoutCnt--;

    if (timeoutCnt == 0) {
      return TIMEOUT;
    }
  }

  tmpVal = BL_RD_REG(PWMx, PWM_CONFIG);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_REG_CLK_SEL, chCfg->clk);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_OUT_INV, chCfg->pol);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_STOP_MODE, chCfg->stopMode);
  BL_WR_REG(PWMx, PWM_CONFIG, tmpVal);

  /* Config pwm division */
  BL_WR_REG(PWMx, PWM_CLKDIV, chCfg->clkDiv);

  /* Config pwm period and duty */
  BL_WR_REG(PWMx, PWM_THRE1, chCfg->threshold1);
  BL_WR_REG(PWMx, PWM_THRE2, chCfg->threshold2);
  BL_WR_REG(PWMx, PWM_PERIOD, chCfg->period);

  /* Config interrupt pulse count */
  tmpVal = BL_RD_REG(PWMx, PWM_INTERRUPT);
  BL_WR_REG(PWMx, PWM_INTERRUPT, BL_SET_REG_BITS_VAL(tmpVal, PWM_INT_PERIOD_CNT, chCfg->intPulseCnt));
  // PWM_IntMask(chCfg->ch, PWM_INT_PULSE_CNT, chCfg->intPulseCnt != 0 ? UNMASK : MASK);
  CPU_Interrupt_Disable(PWM_IRQn);

  // #ifndef BFLB_USE_HAL_DRIVER
  //     Interrupt_Handler_Register(PWM_IRQn, PWM_IRQHandler);
  // #endif

  return SUCCESS;
}

/****************************************************************************/ /**
                                                                                * @brief  PWM channel update source memory address and len
                                                                                *
                                                                                * @param  ch: PWM channel
                                                                                * @param  period: period
                                                                                * @param  threshold1: threshold1
                                                                                * @param  threshold2: threshold2
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void PWM_Channel_Update(PWM_CH_ID_Type ch, uint16_t period, uint16_t threshold1, uint16_t threshold2) {
  /* Get channel register */
  uint32_t PWMx = PWM_Get_Channel_Reg(ch);

  /* Check the parameters */
  CHECK_PARAM(IS_PWM_CH_ID_TYPE(ch));

  /* Config pwm period and duty */
  BL_WR_REG(PWMx, PWM_THRE1, threshold1);
  BL_WR_REG(PWMx, PWM_THRE2, threshold2);
  BL_WR_REG(PWMx, PWM_PERIOD, period);
}

/****************************************************************************/ /**
                                                                                * @brief  PWM channel update clock divider
                                                                                *
                                                                                * @param  ch: PWM channel
                                                                                * @param  div: Clock divider
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void PWM_Channel_Set_Div(PWM_CH_ID_Type ch, uint16_t div) {
  /* Get channel register */
  uint32_t PWMx = PWM_Get_Channel_Reg(ch);

  /* Check the parameters */
  CHECK_PARAM(IS_PWM_CH_ID_TYPE(ch));

  BL_WR_REG(PWMx, PWM_CLKDIV, div);
}

/****************************************************************************/ /**
                                                                                * @brief  PWM channel update threshold1
                                                                                *
                                                                                * @param  ch: PWM channel
                                                                                * @param  threshold1: threshold1
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void PWM_Channel_Set_Threshold1(PWM_CH_ID_Type ch, uint16_t threshold1) {
  /* Get channel register */
  uint32_t PWMx = PWM_Get_Channel_Reg(ch);

  /* Check the parameters */
  CHECK_PARAM(IS_PWM_CH_ID_TYPE(ch));

  /* Config pwm period and duty */
  BL_WR_REG(PWMx, PWM_THRE1, threshold1);
}

/****************************************************************************/ /**
                                                                                * @brief  PWM channel update threshold2
                                                                                *
                                                                                * @param  ch: PWM channel
                                                                                * @param  threshold2: threshold2
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void PWM_Channel_Set_Threshold2(PWM_CH_ID_Type ch, uint16_t threshold2) {
  /* Get channel register */
  uint32_t PWMx = PWM_Get_Channel_Reg(ch);

  /* Check the parameters */
  CHECK_PARAM(IS_PWM_CH_ID_TYPE(ch));

  /* Config pwm period and duty */
  BL_WR_REG(PWMx, PWM_THRE2, threshold2);
}

/****************************************************************************/ /**
                                                                                * @brief  PWM channel update period
                                                                                *
                                                                                * @param  ch: PWM channel
                                                                                * @param  period: period
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void PWM_Channel_Set_Period(PWM_CH_ID_Type ch, uint16_t period) {
  /* Get channel register */
  uint32_t PWMx = PWM_Get_Channel_Reg(ch);

  /* Check the parameters */
  CHECK_PARAM(IS_PWM_CH_ID_TYPE(ch));

  /* Config pwm period and duty */
  BL_WR_REG(PWMx, PWM_PERIOD, period);
}

/****************************************************************************/ /**
                                                                                * @brief  PWM get configuration
                                                                                *
                                                                                * @param  ch: PWM channel
                                                                                * @param  period: period pointer
                                                                                * @param  threshold1: threshold1 pointer
                                                                                * @param  threshold2: threshold2 pointer
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void PWM_Channel_Get(PWM_CH_ID_Type ch, uint16_t *period, uint16_t *threshold1, uint16_t *threshold2) {
  uint32_t tmpVal;
  /* Get channel register */
  uint32_t PWMx = PWM_Get_Channel_Reg(ch);

  /* Check the parameters */
  CHECK_PARAM(IS_PWM_CH_ID_TYPE(ch));

  /* get pwm period and duty */
  tmpVal      = BL_RD_REG(PWMx, PWM_THRE1);
  *threshold1 = BL_GET_REG_BITS_VAL(tmpVal, PWM_THRE1);
  tmpVal      = BL_RD_REG(PWMx, PWM_THRE2);
  *threshold2 = BL_GET_REG_BITS_VAL(tmpVal, PWM_THRE2);
  tmpVal      = BL_RD_REG(PWMx, PWM_PERIOD);
  *period     = BL_GET_REG_BITS_VAL(tmpVal, PWM_PERIOD);
}

/****************************************************************************/ /**
                                                                                * @brief  PWM enable
                                                                                *
                                                                                * @param  ch: PWM channel number
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void PWM_Channel_Enable(PWM_CH_ID_Type ch) {
  uint32_t tmpVal;
  /* Get channel register */
  uint32_t PWMx = PWM_Get_Channel_Reg(ch);

  /* Check the parameters */
  CHECK_PARAM(IS_PWM_CH_ID_TYPE(ch));

  /* Config pwm clock to enable pwm */
  tmpVal = BL_RD_REG(PWMx, PWM_CONFIG);
  BL_WR_REG(PWMx, PWM_CONFIG, BL_CLR_REG_BIT(tmpVal, PWM_STOP_EN));
}

/****************************************************************************/ /**
                                                                                * @brief  PWM disable
                                                                                *
                                                                                * @param  ch: PWM channel number
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void PWM_Channel_Disable(PWM_CH_ID_Type ch) {
  uint32_t tmpVal;
  /* Get channel register */
  uint32_t PWMx = PWM_Get_Channel_Reg(ch);

  /* Check the parameters */
  CHECK_PARAM(IS_PWM_CH_ID_TYPE(ch));

  /* Config pwm clock to disable pwm */
  tmpVal = BL_RD_REG(PWMx, PWM_CONFIG);
  BL_WR_REG(PWMx, PWM_CONFIG, BL_SET_REG_BIT(tmpVal, PWM_STOP_EN));
  PWM_IntMask(ch, PWM_INT_PULSE_CNT, MASK);
}

/****************************************************************************/ /**
                                                                                * @brief  PWM channel software mode enable or disable
                                                                                *
                                                                                * @param  ch: PWM channel number
                                                                                * @param  enable: Enable or disable
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void PWM_SW_Mode(PWM_CH_ID_Type ch, BL_Fun_Type enable) {
  uint32_t tmpVal;
  /* Get channel register */
  uint32_t PWMx = PWM_Get_Channel_Reg(ch);

  /* Check the parameters */
  CHECK_PARAM(IS_PWM_CH_ID_TYPE(ch));

  tmpVal = BL_RD_REG(PWMx, PWM_CONFIG);
  BL_WR_REG(PWMx, PWM_CONFIG, BL_SET_REG_BITS_VAL(tmpVal, PWM_SW_MODE, enable));
}

/****************************************************************************/ /**
                                                                                * @brief  PWM channel force output high or low
                                                                                *
                                                                                * @param  ch: PWM channel number
                                                                                * @param  value: Output value
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void PWM_SW_Force_Value(PWM_CH_ID_Type ch, uint8_t value) {
  uint32_t tmpVal;
  /* Get channel register */
  uint32_t PWMx = PWM_Get_Channel_Reg(ch);

  /* Check the parameters */
  CHECK_PARAM(IS_PWM_CH_ID_TYPE(ch));

  tmpVal = BL_RD_REG(PWMx, PWM_CONFIG);
  BL_WR_REG(PWMx, PWM_CONFIG, BL_SET_REG_BITS_VAL(tmpVal, PWM_SW_FORCE_VAL, value));
}

/****************************************************************************/ /**
                                                                                * @brief  PWM channel force output high
                                                                                *
                                                                                * @param  ch: PWM channel number
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void PWM_Channel_Fource_Output(PWM_CH_ID_Type ch) {
  uint32_t tmpVal;
  /* Get channel register */
  uint32_t PWMx = PWM_Get_Channel_Reg(ch);

  /* Check the parameters */
  CHECK_PARAM(IS_PWM_CH_ID_TYPE(ch));

  tmpVal = BL_RD_REG(PWMx, PWM_CONFIG);
  BL_WR_REG(PWMx, PWM_CONFIG, BL_SET_REG_BIT(tmpVal, PWM_SW_MODE));
}

/****************************************************************************/ /**
                                                                                * @brief  Mask/Unmask the PWM interrupt
                                                                                *
                                                                                * @param  ch: PWM channel number
                                                                                * @param  intType: Specifies the interrupt type
                                                                                * @param  intMask: Enable/Disable Specified interrupt type
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void PWM_IntMask(PWM_CH_ID_Type ch, PWM_INT_Type intType, BL_Mask_Type intMask) {
  uint32_t tmpVal;
  /* Get channel register */
  uint32_t PWMx = PWM_Get_Channel_Reg(ch);

  /* Check the parameters */
  CHECK_PARAM(IS_PWM_CH_ID_TYPE(ch));
  CHECK_PARAM(IS_PWM_INT_TYPE(intType));

  tmpVal = BL_RD_REG(PWMx, PWM_INTERRUPT);

  switch (intType) {
  case PWM_INT_PULSE_CNT:
    if (intMask == UNMASK) {
      /* UNMASK(Enable) this interrupt */
      BL_WR_REG(PWMx, PWM_INTERRUPT, BL_SET_REG_BIT(tmpVal, PWM_INT_ENABLE));
    } else {
      /* MASK(Disable) this interrupt */
      BL_WR_REG(PWMx, PWM_INTERRUPT, BL_CLR_REG_BIT(tmpVal, PWM_INT_ENABLE));
    }

    break;

  case PWM_INT_ALL:
    if (intMask == UNMASK) {
      /* UNMASK(Enable) this interrupt */
      BL_WR_REG(PWMx, PWM_INTERRUPT, BL_SET_REG_BIT(tmpVal, PWM_INT_ENABLE));
    } else {
      /* MASK(Disable) this interrupt */
      BL_WR_REG(PWMx, PWM_INTERRUPT, BL_CLR_REG_BIT(tmpVal, PWM_INT_ENABLE));
    }

    break;

  default:
    break;
  }
}

/****************************************************************************/ /**
                                                                                * @brief  Install PWM interrupt callback function
                                                                                *
                                                                                * @param  ch: PWM channel number
                                                                                * @param  intType: PWM interrupt type
                                                                                * @param  cbFun: Pointer to interrupt callback function. The type should be void (*fn)(void)
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
void PWM_Int_Callback_Install(PWM_CH_ID_Type ch, uint32_t intType, intCallback_Type *cbFun) { PWMIntCbfArra[ch][intType] = cbFun; }

/****************************************************************************/ /**
                                                                                * @brief  PWM smart configure according to frequency and duty cycle function
                                                                                *
                                                                                * @param  ch: PWM channel number
                                                                                * @param  frequency: PWM frequency
                                                                                * @param  dutyCycle: PWM duty cycle
                                                                                *
                                                                                * @return SUCCESS or TIMEOUT
                                                                                *
                                                                                *******************************************************************************/
BL_Err_Type PWM_Smart_Configure(PWM_CH_ID_Type ch, uint32_t frequency, uint8_t dutyCycle) {
  uint32_t tmpVal;
  uint16_t clkDiv, period, threshold2;
  uint32_t timeoutCnt = PWM_STOP_TIMEOUT_COUNT;
  /* Get channel register */
  uint32_t PWMx = PWM_Get_Channel_Reg(ch);

  if (frequency <= 32) {
    clkDiv     = 500;
    period     = 64000 / frequency;
    threshold2 = 640 * dutyCycle / frequency;
  } else if (frequency <= 62) {
    clkDiv     = 16;
    period     = 2000000 / frequency;
    threshold2 = 20000 * dutyCycle / frequency;
  } else if (frequency <= 124) {
    clkDiv     = 8;
    period     = 4000000 / frequency;
    threshold2 = 40000 * dutyCycle / frequency;
  } else if (frequency <= 246) {
    clkDiv     = 4;
    period     = 8000000 / frequency;
    threshold2 = 80000 * dutyCycle / frequency;
  } else if (frequency <= 490) {
    clkDiv     = 2;
    period     = 16000000 / frequency;
    threshold2 = 160000 * dutyCycle / frequency;
  } else {
    clkDiv     = 1;
    period     = 32000000 / frequency;
    threshold2 = 320000 * dutyCycle / frequency;
  }

  tmpVal = BL_RD_REG(PWMx, PWM_CONFIG);
  if (BL_GET_REG_BITS_VAL(tmpVal, PWM_REG_CLK_SEL) != PWM_CLK_XCLK) {
    BL_WR_REG(PWMx, PWM_CONFIG, BL_SET_REG_BIT(tmpVal, PWM_STOP_EN));
    while (!BL_IS_REG_BIT_SET(BL_RD_REG(PWMx, PWM_CONFIG), PWM_STS_TOP)) {
      timeoutCnt--;
      if (timeoutCnt == 0) {
        return TIMEOUT;
      }
    }
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_REG_CLK_SEL, PWM_CLK_XCLK);
  }
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_OUT_INV, PWM_POL_NORMAL);
  tmpVal = BL_SET_REG_BITS_VAL(tmpVal, PWM_STOP_MODE, PWM_STOP_GRACEFUL);
  BL_WR_REG(PWMx, PWM_CONFIG, tmpVal);

  /* Config pwm division */
  BL_WR_REG(PWMx, PWM_CLKDIV, clkDiv);

  /* Config pwm period and duty */
  BL_WR_REG(PWMx, PWM_PERIOD, period);
  BL_WR_REG(PWMx, PWM_THRE1, 0);
  BL_WR_REG(PWMx, PWM_THRE2, threshold2);

  return SUCCESS;
}

/****************************************************************************/ /**
                                                                                * @brief  PWM interrupt function
                                                                                *
                                                                                * @param  None
                                                                                *
                                                                                * @return None
                                                                                *
                                                                                *******************************************************************************/
#ifndef BFLB_USE_HAL_DRIVER
void PWM_IRQHandler(void) { PWM_IntHandler(PWM_IRQn); }
#endif

/*@} end of group PWM_Public_Functions */

/*@} end of group PWM */

/*@} end of group BL702_Peripheral_Driver */
